tsung_logs/pagination/tsung_logs/tsung_example/tsung_example.xml
<?xml version="1.0"?><tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="richardtsung.eba-p7hsp2c9.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>
    <option name="file_server" id="accounts" value="accounts.csv"/>
  </options>

  <sessions>
    <session name="rsvp" type="ts_http" weight="1">
      <setdynvars sourcetype="file" fileid="accounts" delimiter="," order="iter">
        <var name="username"/>
        <var name="password"/>
      </setdynvars>

      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->         io:format([126, $p, 126, $n, 126, $n], [DynVars]),         ok end.">
        <var name="dump"/>
      </setdynvars>
      
      <request>
        <http method="GET" url="/login"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/login" version="1.1" method="POST" contents="username=%%_username%%&amp;password=%%_password%%" content_type="application/x-www-form-urlencoded">
        </http>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http method="GET" url="/"/>
      </request>
    </session>
  </sessions>
</tsung>